;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

;; (package! which-key-posframe)

(package! org-modern)

(package! gpastel)

(package! doct)

(package! sauron)

(package! ytdl)

;; (package! mini-frame)

(package! tree-sitter-langs)

(package! biblio)

(package! copilot
  :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")));; (package! mermaid-mode)

(package! kele)

(package! aidermacs)

;; (package! lastfm)

;; (package! vuiet)
