;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)

(package! md4rd)

(package! org-roam :recipe (:host github :repo "jethrokuan/org-roam" :branch "master"))

(package! exwm)

(package! desktop-environment)

(package! which-key-posframe)

(package! gpastel)

(package! doct)

(package! slack)

(package! sauron)

;; (package! lastfm)

;; (package! vuiet)
